Revit 2021.1 API
UnitFormatUtils.Format Method (Units, UnitType, Double, Boolean, Boolean)
 Formats a number with units into a string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `Format(Units, ForgeTypeId, double, bool)` overload instead.")]
public static string Format(
	Units units,
	UnitType unitType,
	double value,
	bool maxAccuracy,
	bool forEditing
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `Format(Units, ForgeTypeId, double, bool)` overload instead.")> _
Public Shared Function Format ( _
	units As Units, _
	unitType As UnitType, _
	value As Double, _
	maxAccuracy As Boolean, _
	forEditing As Boolean _
) As String
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `Format(Units, ForgeTypeId, double, bool)` overload instead.")]
public:
static String^ Format(
	Units^ units,
	UnitType unitType,
	double value,
	bool maxAccuracy,
	bool forEditing
)
Parameters
units
Type: Autodesk.Revit.DB.Units
 The units formatting settings, typically obtained from Document.GetUnits().
unitType
Type: Autodesk.Revit.DB.UnitType
 The unit type of the value to format.
value
Type: System.Double
 The value to format, in Revit's internal units.
maxAccuracy
Type: System.Boolean
 True if the value should be rounded to an increased accuracy level appropriate for editing or understanding the precise value stored in the model. False if the accuracy specified by the FormatOptions should be used, appropriate for printed drawings.
forEditing
Type: System.Boolean
 True if the formatting should be modified as necessary so that the formatted string can be successfully parsed, for example by suppressing digit grouping. False if unmodified settings should be used, suitable for display only.
Return Value
 The formatted string.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  unitType is an invalid unit type. See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes(). -or- The given value for value is not finite
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
UnitFormatUtils Class
Format Overload
Autodesk.Revit.DB Namespace